//준홍이는 수학을 좋아한다.
//
//최근에 한 수학책에서 자연수는 최대 네 개의 제곱수로 표현할 수 있다는 것을 읽었다.
//
//여기서 제곱수란, 음이 아닌 정수를 제곱한 수를 말한다.
//
//준홍이는 어떤 자연수 N을 네 개 이하의 제곱수의 합으로 표현할 수 있는 경우의 수가 궁금해졌다.
//
//준홍이는 경우의 수를 구할 때, 제곱수의 순서가 바뀌는 경우는 같은 경우로 간주한다.
//
//따라서 02 + 12 = 12 + 02 이다.
//
//그리고 N = 25인 경우, 25 = 12 + 22 + 22 + 42 = 32 + 42 = 52 총 3가지 방법이 존재한다.
//
//자연수 N이 주어졌을 때에 N을 네 개 이하의 제곱수의 합으로 표현할 수 있는 경우의 수를 구하는 프로그램을 작성하라.
//
//
//[입력]
//
//첫 번째 줄에 테스트 케이스의 수 T가 주어진다.
//
//각 테스트 케이스에 해당하는 줄에는 자연수 N(1 ≤ N ≤ 32767)이 하나 주어진다.
//
//
//[출력]
//
//각 테스트 케이스마다 ‘#x’(x는 테스트케이스 번호를 의미하며 1부터 시작한다)를 출력하고, 해당하는 답을 한 줄에 하나씩 출력한다.
package Battle;

public class Solution_53_2_준홍이의네개의제곱수 {
	public static void main(String[] args) {
		
	}
}
